Chapters/Chapter_3/periodicSolitary_cph20/0.orig/U.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U.org;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cyclic1
    {
        type            cyclic;
    }
 
    cyclic2
    {
        type            cyclic;
    }

    bottom
    {
        type            slip;
    }
    
    atmosphere
    {
        type            zeroGradient;
    }
    
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
