Chapters/Chapter_3/periodicSolitary_cph20/constant/waveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

wave_period         8;

rel_depth           0.4;

steepness           0.005;

wave_length         98.6211;

water_depth         39.4484;

wave_height         0.493106;

Lg                  98.6211;

La                  197.242;

Lp                  98.6211;

height_y            0.986212;

ref_level           1;

CPH                 20;

aspect_ratio        1;

aspect_ratio_max    4;

seaLevel            0;

relaxationNames     ( );

initializationName  cyclic1;

cyclic1Coeffs
{
    waveType            stokesSecond;
    Tsoft               0;
    depth               39.4484;
    period              8;
    direction           ( 1 0 0 );
    phi                 0;
    height              0.493106;
    waveNumber          (0.0637104 0 0);
    omega               0.785398;
    debug               false;
}



// ************************************************************************* //
